# VisualLightTransmittance Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyThermalProperties..::..VisualLightTransmittance Property
FamilyThermalProperties Class See Also
---
The visual light transmittance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double VisualLightTransmittance { get; }
```

Visual Basic
---
```text
Public ReadOnly Property VisualLightTransmittance As Double
	Get
```

Visual C++
---
```text
public:
property double VisualLightTransmittance {
	double get ();
}
```

# See Also
FamilyThermalProperties Class
Autodesk.Revit.DB Namespace